"{\"title\": \"Hanted Mansion\", \"author\": \"Adam\", \"start_anchor\": \"turn1\", \"content\": {\"turn1\": {\"intro\": \"You are a hired exorcist that has been paid by an affluent man to investigate his summer home in the Vermont woodlands. A handsome reward awaits you upon completion of the job, but busting ghosts is a risky profession, sometimes not even worth the money. You face the door, your ghost-busting tools in hand. Therein, your first choice presents itself:\", \"question\": \"DO YOU GO THROUGH THE DOOR?\", \"answer\": [[1, \"(1) Yes, I open the door\", \"You enter the living room\", \"turn2.1\"], [2, \"(2) No, I go home\", \"You go back to your car\", \"end7\"]]}, \"end7\": {\"intro\": \"You cut your losses and leave, Nothing Ventured, Nothing gained\", \"question\": null, \"answer\": []}, \"turn2.1\": {\"intro\": \"The living room is dark, befitting of a house left unused since the turn of the last season. However, despite it being unused, you can never be sure that you are alone. In particular, three peculiar things stick out to you. To your left, there is a fireplace, whose acrid scent of ash implies that its freshly lit - an oddity considering that there would have been no one to light it in the last handful of months. To your right, there is a door with a restroom sign above, a pale green light shining through the gaps in its hinges. And straight ahead is the dining hall, which is dark\\u2026 which is surprisingly typical considering the time.\", \"question\": \"HOW DO YOU PROCEED?\", \"answer\": [[1, \"(1)  I will investigate the restroom\", \"With your spectral radar and holy cross in hand, you carefully open the bathroom door.\", \"turn3.1\"], [2, \"(2)  I will investigate the fireplace\", \"The soot scent deepens, becoming increasingly harder to tolerate as it becomes difficult to breathe. You can hear the crackling of fire, despite there being no visible flames, an orange ring encroaches upon your vision, being the last thing you see as you slip into unconsciousness.\", \"turn3.1\"], [3, \"(3)  I will investigate the dining room\", \"You brandish your tools, radar and cross in hand as you delve into the darkness.\", \"end2\"]]}, \"end2\": {\"intro\": \"The shadows swallow you whole.\", \"question\": null, \"answer\": []}, \"turn3.1\": {\"intro\": \"The guest bathroom is a long corridor, with multiple closed stalls and a urinal at the end of the hallway. Therein lies the source of the glow, a teal cube of water that floats above the tank. Within it lies the silhouette of a boy, unlikely to be the phantom you are looking for but a ghost nonetheless.\", \"question\": \"HOW DO YOU PROCEED?\", \"answer\": [[1, \"I investigate the water\", \"Ahead, you are noticed by the ghost.\", \"turn4\"], [2, \"I return to the living room\", \"You return to the living room\", \"turn2.1\"]]}, \"turn4\": {\"intro\": \"Upon noticing you, the ghost wastes no time in asking something of you. He claims to be a former servant of the Tenebrous One, the master phantom haunting the manor. The ghost claims that the master phantom has betrayed him and trapped him inside a prison of water. The only way to free him is to flush the valve. However, you can\\u2019t help but wonder if a ghost story is worth your trust.\", \"question\": \"DO YOU BELIEVE THE GHOST?\", \"answer\": [[1, \"Yes, I play it safe and exorcize the lavatory spirit\", \"You take out a silver cross and raise it to the waters. Immediately, the ghost shrieks as it disintegrates into a storm of fizzling ectoplasm.\", \"turn5.1\"], [2, \"I put my trust in the spirit and free him\", \"With a nod, you oblige and flush away the ghost's watery prison. With a spectral current rushing down the drain, the ghost is now free.\", \"turn5\"]]}, \"turn5\": {\"intro\": \"Good sir, I am forever in your debt.\\n\\n\\u201cThe ghost profusely thanks you for your aid, his boyish whimsy adding some levity to what would otherwise be a foreboding and miserable place. There is no business left for you in the restroom, and you return to the living room with the phantom. Once there, you are once again presented with the same set of avenues.\\u201d\", \"question\": \"HOW DO YOU PROCEED?\", \"answer\": [[1, \"I investigate the fireplace\", \"You begin to move towards the fireplace, and its oddly fresh scent of soot. At first, the acrid stench makes you delirious, your steps feel heavy as you begin to slip into a permanent slumber. However, before that could happen, the sound of a whirlpool flushed away the bewitching cinders, the lavatory spirit staring daggers into the fireplace.\", \"turn6\"], [2, \"I investigate the dining room\", \"Proceed to investigate the dining room\", \"turn7\"], [3, \"I return to the front door\", \"Proceed to return to the front door\", \"turn1\"]]}, \"turn6\": {\"intro\": \"The lavatory ghost stands in front of you, his pudgy hands pointed down at the hearth as the spirit possessing it gurgles on its own ectoplasm.\\n\\n\\u201cCOME OFF IT, I HAVE NO DESIRE TO BE CAUGHT IN YOUR ROTTEN GAMES!\\u2019\\n\\nHe seemed angry, the whirlpool fading away as a bright orange flame sputtered to life on the charred logs.\\n\\nA pair of eyes has appeared on the flames, and its crackling sparks form a voice\\u2026 one lost in a fit of coughs. The coughing fire looks up resentfully but there is a notable lack of malice in its eyes. When it looks at the lavatory ghost, there appears to be a degree of familiarity to its glowering. Though the same could not be said from the way it looked at you, but at the very least the fire wasn\\u2019t playing tricks on you.\", \"question\": \"WHAT DO YOU ASK OF THE FLAMES?\", \"answer\": [[1, \"I ask the fire for aid\", \"You attempt to ask the fire for help, the lavatory spirit sulks.\", \"turn7\"], [2, \"I force the fire to leave\", \"You brandish your cross, and try to shoo away the flames\", \"turn7.1\"]]}, \"turn7\": {\"intro\": \"The shadows are warded back to the kitchen, and you can pass safely through the living room. The orange firelight reflecting off the walls shines on the empty chairs, creating silhouettes of dinner guests that did not exist. Amid the table of profiles, there were plates ahead of three seats. The first held a golden lighter, the second held a vial of holy water.\", \"question\": \"WHICH ITEM DO YOU TAKE?\", \"answer\": [[1, \"I pick up the lighter\", \"You grab the lighter\", \"turn8\"], [2, \"I pick the holy water\", \"You grab the holy water\", \"turn8.1\"]]}, \"turn7.1\": {\"intro\": \"The shadows are warded back to the edge of the kitchen, granting you safe passage through the living room. The cold light makes the pulled chairs look that much emptier. Amid the ghost of a banquet, two of the table\\u2019s seats had plates ahead. Atop one was a vial of holy water, and the other an inverted cross.\", \"question\": \"WHICH ITEM DO YOU TAKE?\", \"answer\": [[1, \"I take the holy water\", \"You take the holy water, as you examine the vial the cross disappears.\", \"turn8a\"], [2, \"I take the reversed cross\", \"You take the reversed cross, as you hold it in your hand, the water disappears.\", \"turn8a.1\"]]}, \"turn8\": {\"intro\": \"You pick up the lighter and examine it. It\\u2019s got an old-fashioned look, with a rendition of Christ on a crucifix embossed on its gold plating. Its hinges are well oiled, the hatch for the lighter flipping open with little resistance, brandishing a mysterious white flame that makes the shadows recede ever so slightly. The vial of water vanishes.\\n\\nWith the white flame in hand, the oozing darkness of the kitchen recoils - steering clear of your body. The lavatory spirit stays behind you, shrinking back as a lone eye opens in a particularly dark patch of periphery. The unholy gaze from its red iris exudes a suffocating pressure. Thankfully, the ward of the lighter is strong enough to protect your mind\\u2026 but you hear a pained cry from behind. It seems your companion wasn\\u2019t so lucky. Immediately, you find yourself unable to breathe, as a sphere of spectral water covers your head, the newly possessed lavatory phantom lifting you in the air as you drown. You have a cross in your pocket and the holy lighter - giving you the means to exorcise him. Therein, your last choice presents itself. Do you turn your tools on the recently liberated phantom, or do you take a risk, and target the tenebrous one anyways.\", \"question\": \"FINAL CHOICE: WHERE DO YOU POINT YOUR CROSS?\", \"answer\": [[1, \"to the GHOST\", \"Despite the lack of air, you can draw the cross from your pocket, its holiness drawing the white flame towards it like some spiritual magnet. Both phantoms hiss at its presence, the lavatory phantom reacting in an especially venomous matter. However, the flames and cross rend his form to shreds, the light purging him once and for all, as the water fades away. As you fall to the floor, you bask in the air you can now breathe - a prize for your victory\\u2026 which alas, is short-lived. The white flame ebbs to nothing, the tenebrous one\\u2019s shadows encroaching unopposed as\\u2026\", \"end4\"], [2, \"to the SHADOW\", \"Even as your lungs burn in their deprivation, you will your hands to draw the cross from your pocket, its silver crux aimed right at the red pupil of the shadow\\u2019s eye. The holiness of the cross draws the white flame, a whorl of platinum sparks conflagrating straight ahead of you. You feel the waters thin around your head, a hiss echoing from the shadows as a light consumes the entirety of the room\\u2026\", \"end5\"]]}, \"turn8.1\": {\"intro\": \"Your ghost companion leads you to the vial of water, saying that it will grant him the strength needed to protect you against the peril of the tenebrous one. You pull the cork off the vial, and immediately the water floats from the bottle merging with the body of your companion. A faint cerulean glow begins to ward away the shadows, as the ghost assumes a form that looks slightly older than how you met him. The lighter vanishes.\\n\\nThe newly rejuvenated ghost leads the charge, his presence causing the shadows of the floor and walls to recoil as you follow closely behind. However, you are the first to notice the presence of the tenebrous one, a giant eye opening from the periphery. Unfortunately, before you had noticed it, the eye had noticed you. You could feel the malice in its stare pierce through you and the specter that guarded you - his newfound fortitude allowing him to brave the master phantom\\u2019s curse. However, you were not as strong - and you felt a sinister pressure weigh down your soul. Your limbs are slowly ceasing to be your own, as the phantom\\u2019s possession begins. Barely you muster the strength to draw the cross from your pocket. What you do with it will be your last act.\", \"question\": \"HOW DO YOU USE YOUR LAST SECONDS?\", \"answer\": [[1, \"Point the cross to the SHADOW\", \"In a last stand, you point the crux of your silver crucifix at the eye, its faint silver glow briefly salving your encumbered conscience. The lavatory spirit attempts to assist you in warding off the imminent possession, but it is a war of attrition that neither of you could win. Unwillingly, your grip loosens around the cross, the metal chipping the floor as it slides off into the shadows. Your mind goes next, your enthrallment rendering the next events a blur. You see yourself ripping apart the phantom who assisted you, and tearing out your own throat with your bare hands - hoping that by stopping your own heart you could protect the world from the calamity that the tenebrous one\\u2019s arrival would bring\\u2026\", \"end8\"], [2, \"Point the cross to the GHOST\", \"In a last stand, you point the crux of your silver crucifix at your own companion. Despite the malice emanating from the shadows, the ghost\\u2019s form remains stoic, his eyes filled with a solemn regret. The cross brandishes a faint silver light, and the both of you could feel the weight of the tenebrous one\\u2019s curse as it washes over you. The spirit opens his mouth, and a cacophony of screams echoes from the walls, the shrieks reverberating off the tenebrous one\\u2019s shadowy form as the darkness fades\\u2026\", \"end9\"]]}, \"end3\": {\"intro\": \"Due to the noise the spirit made in death, you attract the Tenebrous One's attention, and its shadows swallow you whole.\", \"question\": null, \"answer\": []}, \"end4\": {\"intro\": \"The eye stares into your soul, its unfettered malice crushing your spirit. The cross in your hand shatters, as your limp body is strung up by shadows. Fangs form in the darkness, the true maw of the spirit revealing itself as The Tenebrous One gorges on your flesh and spirit till nothing is left remaining.\", \"question\": null, \"answer\": []}, \"end5\": {\"intro\": \"Together, the two of you escape the fog, greeted by the fresh light of the moon. Looking back to the mansion, it is clear that the tenebrous one is something you cannot fight alone. You can always request the help of more exorcists, and fight another day.\", \"question\": null, \"answer\": []}, \"turn8a\": {\"intro\": \"You take the holy water, as you examine the vial the cross disappears.\", \"question\": null, \"answer\": []}, \"turn8a.1\": {\"intro\": \"You take the reversed cross, as you hold it in your hand, the water disappears.\", \"question\": null, \"answer\": []}, \"end8\": {\"intro\": \"The eye seems to get further away the more you run towards it, as the fog gets thicker and harder to cut through. Eventually, the sound of your own mind screaming drowns out all other phenomena as you double down - falling victim to your rapid onset insanity.\", \"question\": null, \"answer\": []}, \"end9\": {\"intro\": \"The eye seems to get further away the more you run towards it, as the fog gets thicker and harder to cut through. Eventually, the sound of your own mind screaming drowns out all other phenomena as you double down - falling victim to your rapid onset insanity.\", \"question\": null, \"answer\": []}}}"